tests/artillery/test-picos.yml
config:
  target: "https://seedor-1.vercel.app"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Normal - 2 usuarios por segundo"
    - duration: 20
      arrivalRate: 30
      name: "Pico de carga - 30 usuarios por segundo"
    - duration: 60
      arrivalRate: 5
      name: "Recuperación - 5 usuarios por segundo"
  processor: "./processor.js"
  plugins:
    metrics-by-endpoint: {}
    expect: {}

scenarios:
  - name: "Test de picos de carga"
    flow:
      # Iniciar sesión
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ $processEnvironment.EMAIL_TEST }}"
            password: "{{ $processEnvironment.PASSWORD_TEST }}"
          expect:
            - statusCode: 200
          afterResponse: "extractAuthToken"
      
      # Visitar la página principal
      - get:
          url: "/home"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
      
      # Navegar al módulo de Campo
      - get:
          url: "/campo"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
      
      # Navegar al módulo de Empaque (sección crítica de negocio)
      - get:
          url: "/empaque"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
      
      # Visitar la sección de pallets (operación crítica)
      - get:
          url: "/empaque/pallets"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200
      
      # Cerrar sesión
      - get:
          url: "/api/auth/logout"
          beforeRequest: "addAuthHeaders"
          expect:
            - statusCode: 200